pvvx/esp8266web/app/web/web_int_callbacks.c
            	ifcmp("remote") {
            			if(mdb_tcp_servcfg != NULL && mdb_tcp_servcfg->conn_links != NULL && mdb_tcp_servcfg->conn_links->pcb) {
            			struct tcp_pcb *pcb = mdb_tcp_servcfg->conn_links->pcb;
            			tcp_puts(IPSTR ":%d", IP2STR(&(pcb->remote_ip.addr)), pcb->remote_port);
            		}
            		else tcp_strcpy_fd("none");
            	}
            	else ifcmp("host") {
        			if(mdb_tcp_servcfg != NULL && mdb_tcp_servcfg->conn_links != NULL && mdb_tcp_servcfg->conn_links->pcb) {
            			struct tcp_pcb *pcb = mdb_tcp_servcfg->conn_links->pcb;
            			tcp_puts(IPSTR ":%d", IP2STR(&(pcb->local_ip.addr)), pcb->local_port);
            		}
            		else tcp_strcpy_fd("closed");
            	}
            	else tcp_put('?');
        	}
        	else {
        		cstr+=5;
        		if((*cstr>='0')&&(*cstr<='9')) {
        			uint32 addr = ahextoul(cstr);
        			if((cstr[-1]=='u' || cstr[-1]=='d') && (addr < 0x10000)) {
        				uint32 val = 0;
        				if(cstr[-2]=='w') {
        					if(RdMdbData((uint8 *)&val, addr, 1) != 0) tcp_put('?');
        					else if (cstr[-1]=='u') tcp_puts("%u", val);
        					else if (cstr[-1]=='s') tcp_puts("%d", val);
        				}
        				else if(cstr[-2]=='d') {
        					if(RdMdbData((uint8 *)&val, addr, 2) != 0) tcp_put('?');
        					else if (cstr[-1]=='u') tcp_puts("%u", val);
        					else if (cstr[-1]=='s') tcp_puts("%d", val);
        				}
        				else tcp_put('?');
        			}
        			else tcp_put('?');
    			}
    			else tcp_put('?');
        	};
        }
#endif
        else ifcmp("sys_") {
          cstr+=4;
          ifcmp("cid") tcp_puts("%08x", system_get_chip_id());
          else ifcmp("fid") tcp_puts("%08x", spi_flash_get_id());
          else ifcmp("fsize") tcp_puts("%u", spi_flash_real_size()); // flashchip->chip_size
          else ifcmp("sdkver") tcp_puts(system_get_sdk_version());
          else ifcmp("sysver") tcp_strcpy_fd(SYS_VERSION);
          else ifcmp("webver") tcp_strcpy_fd(WEB_SVERSION);
          else ifcmp("heap") tcp_puts("%u", system_get_free_heap_size());
          else ifcmp("adc") {
        	  uint16 x[4];
        	  read_adcs(x, 4);
        	  tcp_puts("%u", x[0]+x[1]+x[2]+x[3]); // 16 бит ADC :)
//        	  tcp_puts("%u", system_adc_read());
          }
          else ifcmp("time") tcp_puts("%u", system_get_time());
          else ifcmp("rtctime") tcp_puts("%u", system_get_rtc_time());
          else ifcmp("vdd33") tcp_puts("%u", readvdd33()); // system_get_vdd33() phy_get_vdd33();
          else ifcmp("wdt") tcp_puts("%u", ets_wdt_get_mode());
          else ifcmp("res_event") tcp_puts("%u", rtc_get_reset_reason()); // 1 - power/ch_pd, 2 - reset, 3 - software, 4 - wdt ...
          else ifcmp("rst") tcp_puts("%u", system_get_rst_info()->reason);
          else ifcmp("clkcpu") tcp_puts("%u", ets_get_cpu_frequency());
          else ifcmp("sleep_old") tcp_puts("%u", deep_sleep_option); // если нет отдельного питания RTC и deep_sleep не устанавливался/применялся при текущем включения питания чипа, то значение неопределенно (там хлам).
//          else ifcmp("test") tcp_puts("%d", cal_rf_ana_gain() ); //
          else ifcmp("reset") web_conn->web_disc_cb = (web_func_disc_cb)_ResetVector;
          else ifcmp("restart") web_conn->web_disc_cb = (web_func_disc_cb)system_restart;
          else ifcmp("ram") tcp_puts("0x%08x", *((uint32 *)(ahextoul(cstr+3)&0xFFFFFFFC)));
          else ifcmp("rdec") tcp_puts("%d", *((uint32 *)(ahextoul(cstr+4)&0xFFFFFFFC)));
//          else ifcmp("reg") tcp_puts("0x%08x", IOREG(ahextoul(cstr+3)));
          else ifcmp("ip") {
/*        	  uint32 cur_ip = 0;
        	  if(netif_default != NULL) cur_ip = netif_default->ip_addr.addr; */
        	  uint32 cur_ip = ts_conn->pcb->local_ip.addr;
//        	  if(cur_ip == 0) cur_ip = 0x0104A8C0;
			  tcp_puts(IPSTR, IP2STR(&cur_ip));
          }
          else ifcmp("url") get_new_url(ts_conn);
          else ifcmp("debug") tcp_puts("%u", system_get_os_print()&1); // system_set_os_print
          else ifcmp("const_") {
        	  cstr += 6;
        	  ifcmp("faddr") {
        		  tcp_puts("0x%08x", esp_init_data_default_addr);
        	  }
        	  else tcp_puts("%u", read_sys_const(ahextoul(cstr)));
          }
          else ifcmp("ucnst_") tcp_puts("%u", read_user_const(ahextoul(cstr+6)));
          else ifcmp("vdd") tcp_puts("%u", system_get_vdd33()); //  phy_get_vdd33();
#ifdef USE_NETBIOS
          else ifcmp("netbios") {
       		  if(syscfg.cfg.b.netbios_ena) tcp_strcpy(netbios_name);
          }
#endif
          else tcp_put('?');
        }
        else ifcmp("cfg_") {
			cstr += 4;
			ifcmp("web_") {
				cstr += 4;
				ifcmp("port") tcp_puts("%u", syscfg.web_port);
	        	else ifcmp("twrec") tcp_puts("%u", syscfg.web_twrec);
	        	else ifcmp("twcls") tcp_puts("%u", syscfg.web_twcls);
				else ifcmp("twd") tcp_put((syscfg.cfg.b.web_time_wait_delete)? '1' : '0');
				else tcp_put('?');
			}
		    else ifcmp("tcp_") {
		    	cstr+=4;
		    	ifcmp("tcrec") tcp_puts("%u", syscfg.tcp_client_twait);
#ifdef USE_TCP2UART
	        	else ifcmp("port") tcp_puts("%u", syscfg.tcp2uart_port);
	        	else ifcmp("twrec") tcp_puts("%u", syscfg.tcp2uart_twrec);
	        	else ifcmp("twcls") tcp_puts("%u", syscfg.tcp2uart_twcls);
	        	else ifcmp("url") {
	        		if(tcp2uart_url == NULL) tcp_puts("none");
	        		else tcp_puts("%s", tcp2uart_url);
	        	}
	        	else ifcmp("reop") tcp_put((syscfg.cfg.b.tcp2uart_reopen)? '1' : '0');
#endif
		    	else tcp_put('?');
		    }
#ifdef USE_MODBUS
		    else ifcmp("mdb_") {
		    	cstr+=4;
		    	ifcmp("port") tcp_puts("%u", syscfg.mdb_remote_port);
		    	else ifcmp("twrec") tcp_puts("%u", syscfg.mdb_twrec);
		    	else ifcmp("twcls") tcp_puts("%u", syscfg.mdb_twcls);
	        	else ifcmp("reop") tcp_put((syscfg.cfg.b.mdb_reopen)? '1' : '0');
		    	else tcp_put('?');
		    }
#endif
#ifdef UDP_TEST_PORT
		    else ifcmp("udp_") {
		    	cstr+=4;
		    	ifcmp("port") tcp_puts("%u", syscfg.udp_test_port);
		    	else tcp_put('?');
		    }
#endif		    
#ifdef USE_WDRV
		    else ifcmp("wdrv_") {
		    	cstr+=5;
		    	ifcmp("port") tcp_puts("%u", syscfg.wdrv_remote_port);
		    	else tcp_put('?');
		    }
#endif
			else ifcmp("overclk") tcp_put((syscfg.cfg.b.hi_speed_enable)? '1' : '0');
			else ifcmp("pinclr") tcp_put((syscfg.cfg.b.pin_clear_cfg_enable)? '1' : '0');
			else ifcmp("debug") tcp_put((syscfg.cfg.b.debug_print_enable)? '1' : '0');
#ifdef USE_NETBIOS
			else ifcmp("netbios") tcp_put((syscfg.cfg.b.netbios_ena)? '1' : '0');
#endif
#ifdef USE_SNTP
			else ifcmp("sntp") tcp_put((syscfg.cfg.b.sntp_ena)? '1' : '0');
#endif
#ifdef USE_CAPTDNS
			else ifcmp("cdns") tcp_put((syscfg.cfg.b.cdns_ena)? '1' : '0');
#endif
		    else tcp_put('?');
		}
        else ifcmp("wifi_") {
          cstr+=5;
          ifcmp("rdcfg") Read_WiFi_config(&wificonfig, WIFI_MASK_ALL);
          else ifcmp("newcfg") {
//        	  tcp_puts("%d", New_WiFi_config(WIFI_MASK_ALL));
        	  web_conn->web_disc_cb = (web_func_disc_cb)New_WiFi_config;
        	  web_conn->web_disc_par = WIFI_MASK_ALL;
          }
          else ifcmp("csta") tcp_puts("%d", wifi_station_get_connect_status());
          else ifcmp("mode") tcp_puts("%d", wifi_get_opmode());
          else ifcmp("id") tcp_puts("%d", wifi_station_get_current_ap_id());
          else ifcmp("phy") tcp_puts("%d", wifi_get_phy_mode());
          else ifcmp("chl") tcp_puts("%d", wifi_get_channel());
          else ifcmp("sleep") tcp_puts("%d", wifi_get_sleep_type());
          else ifcmp("scan") web_wscan_xml(ts_conn);
          else ifcmp("aps_xml") wifi_aps_xml(ts_conn);
          else ifcmp("prrq_xml") web_ProbeRequest_xml(ts_conn);
//          else ifcmp("aucn") tcp_puts("%d", wifi_station_get_auto_connect());
          else ifcmp("power") { rom_en_pwdet(1); tcp_puts("%d", rom_get_power_db()); }
          else ifcmp("noise") tcp_puts("%d", get_noisefloor_sat()); // noise_init(), rom_get_noisefloor(), ram_get_noisefloor(), ram_set_noise_floor(),noise_check_loop(), read_hw_noisefloor(), ram_start_noisefloor()
          else ifcmp("hwnoise") tcp_puts("%d", read_hw_noisefloor());
          else ifcmp("fmsar") { // Test!
        	  rom_en_pwdet(1); // ?
        	  tcp_puts("%d", ram_get_fm_sar_dout(ahextoul(cstr+5)));
          }
          else ifcmp("rfopt") tcp_puts("%u",(RTC_RAM_BASE[24]>>16)&7); // system_phy_set_rfoption | phy_afterwake_set_rfoption(option); 0..4
          else ifcmp("vddpw") tcp_puts("%u", phy_in_vdd33_offset); // system_phy_set_tpw_via_vdd33(val); // = pphy_vdd33_set_tpw(vdd_x_1000); Adjust RF TX Power according to VDD33, unit: 1/1024V, range [1900, 3300]
          else ifcmp("maxpw") tcp_puts("%u", phy_in_most_power); // read_sys_const(34));// system_phy_set_max_tpw(val); // = phy_set_most_tpw(pow_db); unit: 0.25dBm, range [0, 82], 34th byte esp_init_data_default.bin
/*
          else ifcmp("aps_") {
        	  cstr+=4;
        	  struct station_config config[5];
        	  int x = wifi_station_get_ap_info(config);
              if(cstr[1] != '_' || cstr[0]<'0' || cstr[0]>'4' ) {
            	  ifcmp("cnt") tcp_puts("%d", x);
            	  else tcp_put('?');
              }
              int i = cstr[0]-'0';
       	      if(i < x) {
       	    	  ifcmp("ssid") tcp_htmlstrcpy(config[i].ssid, sizeof(config[0].ssid));
       	    	  else ifcmp("psw") tcp_htmlstrcpy(config[i].password, sizeof(config[0].password));
       	    	  else ifcmp("sbss") tcp_puts("%d", config[i].bssid_set);
       	      	  else ifcmp("bssid") tcp_puts(MACSTR, MAC2STR(config[i].bssid));
              	  else tcp_put('?');
       	      }
          } */
          else {
            uint8 if_index;
            ifcmp("ap_")	if_index = SOFTAP_IF;
            else ifcmp("st_")	if_index = STATION_IF;
            else { tcp_put('?'); return; };
            cstr+=3;
            ifcmp("dncp") {
            	if (if_index == SOFTAP_IF) tcp_puts("%d", (dhcps_flag==0)? 0 : 1);
            	else tcp_puts("%d", (dhcpc_flag==0)? 0 : 1);
            	return;
            }
            else ifcmp("aucn") {
            	if(if_index == STATION_IF) tcp_puts("%d", wifi_station_get_auto_connect());
            	else tcp_put('?');
            	return;
            }
            uint8 macaddr[6];
			wifi_get_macaddr(if_index, macaddr);
            uint8 opmode = wifi_get_opmode();
			struct ip_info wifi_info;
#ifndef USE_OPEN_DHCPS
			struct dhcps_lease dhcps_lease = wificonfig.ap.ipdhcp;
			wifi_softap_get_dhcps_lease(&dhcps_lease);
#endif
            if(if_index == SOFTAP_IF) {
              if (((opmode & SOFTAP_MODE) == 0) || (!wifi_get_ip_info(SOFTAP_IF, &wifi_info))) {
            	  wifi_info = wificonfig.ap.ipinfo;
#ifdef USE_OPEN_DHCPS
            	  dhcps_lease = wificonfig.ap.ipdhcp;
#endif
//            	  p_dhcps_lease->start_ip = htonl(wificonfig.ap.ipdhcp.start_ip);
//            	  p_dhcps_lease->end_ip = htonl(wificonfig.ap.ipdhcp.end_ip);
//            	  p_dhcps_lease->start_ip = wificonfig.ap.ipdhcp.start_ip;
//            	  p_dhcps_lease->end_ip = wificonfig.ap.ipdhcp.end_ip;
              }
          	  ifcmp("sip") tcp_puts(IPSTR, IP2STR((struct ip_addr *)&dhcps_lease.start_ip));
          	  else ifcmp("eip") tcp_puts(IPSTR, IP2STR((struct ip_addr *)&dhcps_lease.end_ip));
          	  else ifcmp("ip") tcp_puts(IPSTR, IP2STR(&wifi_info.ip));
              else ifcmp("gw") tcp_puts(IPSTR, IP2STR(&wifi_info.gw));
              else ifcmp("mac") tcp_puts(MACSTR, MAC2STR(macaddr));
              else ifcmp("msk") tcp_puts(IPSTR, IP2STR(&wifi_info.netmask));
              else {
                  struct softap_config wicfgap;
                  if(((opmode & SOFTAP_MODE) == 0) || (!wifi_softap_get_config(&wicfgap)) ) wicfgap = wificonfig.ap.config;
                  ifcmp("ssid") tcp_htmlstrcpy(wicfgap.ssid, sizeof(wicfgap.ssid));
                  else ifcmp("psw") tcp_htmlstrcpy(wicfgap.password, sizeof(wicfgap.password));
                  else ifcmp("chl") tcp_puts("%d", wicfgap.channel);
                  else ifcmp("aum") tcp_puts("%d", wicfgap.authmode);
                  else ifcmp("hssid") tcp_puts("%d", wicfgap.ssid_hidden);
                  else ifcmp("mcns") tcp_puts("%d", wicfgap.max_connection);
                  else ifcmp("bint") tcp_puts("%d", wicfgap.beacon_interval);
                  else tcp_put('?');
              };
            }
            else {
            	ifcmp("rssi") tcp_puts("%d", wifi_station_get_rssi());
                else ifcmp("rect") tcp_puts("%u", wificonfig.st.reconn_timeout);
                else ifcmp("hostname") { if(hostname != NULL) tcp_puts(hostname); else tcp_puts("none"); }
            	else {
                	if (((opmode & STATION_MODE) == 0) || (!wifi_get_ip_info(STATION_IF, &wifi_info))) wifi_info = wificonfig.st.ipinfo;
                    ifcmp("ip") tcp_puts(IPSTR, IP2STR(&wifi_info.ip));
                    else ifcmp("gw") tcp_puts(IPSTR, IP2STR(&wifi_info.gw));
                    else ifcmp("mac") tcp_puts(MACSTR, MAC2STR(macaddr));
                    else ifcmp("msk") tcp_puts(IPSTR, IP2STR(&wifi_info.netmask));
                    else {
                        struct station_config wicfgs;
                        if(((opmode & STATION_MODE) == 0) || (!wifi_station_get_config(&wicfgs)) ) wicfgs = wificonfig.st.config;
                        ifcmp("ssid") tcp_htmlstrcpy(wicfgs.ssid, sizeof(wicfgs.ssid));
                        else ifcmp("psw") tcp_htmlstrcpy(wicfgs.password, sizeof(wicfgs.password));
                        else ifcmp("sbss") tcp_puts("%d", wicfgs.bssid_set);
                        else ifcmp("bssid") tcp_puts(MACSTR, MAC2STR(wicfgs.bssid));
                        else tcp_put('?');
                    };
            	};
            };
          };
        }
        else ifcmp("uart_") {
            cstr+=5;
            volatile uint32 * uart_reg = uart0_;
            if(cstr[1] != '_' || cstr[0]<'0' || cstr[0]>'1' ) {
            	tcp_put('?');
            	return;
            }
            if(cstr[0] != '0') uart_reg = uart1_;
            cstr += 2;
            ifcmp("baud") tcp_puts("%u", (uint32) UART_CLK_FREQ / (uart_reg[IDX_UART_CLKDIV] & UART_CLKDIV_CNT));
            else ifcmp("reg")	tcp_puts("%08x", uart_reg[hextoul(cstr + 3)]);
            else ifcmp("parity") tcp_put((uart_reg[IDX_UART_CONF0] & UART_PARITY_EN)? '1':'0');
            else ifcmp("even") tcp_put((uart_reg[IDX_UART_CONF0] & UART_PARITY)? '1' : '0');
            else ifcmp("bits") tcp_puts("%u", (uart_reg[IDX_UART_CONF0] >> UART_BIT_NUM_S) & UART_BIT_NUM);
            else ifcmp("stop") tcp_puts("%u",(uart_reg[IDX_UART_CONF0] >> UART_STOP_BIT_NUM_S) & UART_STOP_BIT_NUM);
            else ifcmp("loopback") tcp_put((uart_reg[IDX_UART_CONF0] & UART_LOOPBACK)? '1' : '0');
            else ifcmp("flow") {
            	if(uart_reg == uart0_) tcp_put((uart0_flow_ctrl_flg)? '1' : '0');
            	else tcp_put((uart_reg[IDX_UART_CONF0]&UART_RX_FLOW_EN)? '1' : '0');
            }
            else ifcmp("rts_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_RTS_INV)? '1' : '0');
            else ifcmp("cts_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_CTS_INV)? '1' : '0');
            else ifcmp("rxd_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_RXD_INV)? '1' : '0');
            else ifcmp("txd_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_TXD_INV)? '1' : '0');
            else ifcmp("dsr_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_DSR_INV)? '1' : '0');
            else ifcmp("dtr_inv") tcp_put((uart_reg[IDX_UART_CONF0]&UART_DTR_INV)? '1' : '0');
            else tcp_put('?');
        }
        else ifcmp("bin_") {
        	cstr+=4;
        	ifcmp("flash") {
        		cstr+=5;
        		if(*cstr == '_') {
        			cstr++;
            		ifcmp("all") {
            	    	web_conn->udata_start = 0;
            	    	web_conn->udata_stop = spi_flash_real_size();
            	    	web_get_flash(ts_conn);
            		}
            		else ifcmp("sec_") {
            			web_conn->udata_start = ahextoul(cstr+4) << 12;
            			web_conn->udata_stop = web_conn->udata_start + SPI_FLASH_SEC_SIZE;
            			web_get_flash(ts_conn);
            		}
            		else ifcmp("const") {
            	    	web_conn->udata_start = esp_init_data_default_addr;
            	    	web_conn->udata_stop = web_conn->udata_start + SIZE_SYS_CONST;
            	    	web_get_flash(ts_conn);
            		}
            		else ifcmp("disk") {
            			web_conn->udata_start = WEBFS_base_addr();
            			web_conn->udata_stop = web_conn->udata_start + WEBFS_curent_size();
            			web_get_flash(ts_conn);
            		}
            		else tcp_put('?');
        		}
        		else web_get_flash(ts_conn);
        	}
        	else ifcmp("ram") web_get_ram(ts_conn);
        }
        else ifcmp("hexdmp") {
        	if(cstr[6]=='d') ts_conn->flag.user_option1 = 1;
        	else ts_conn->flag.user_option1 = 0;
        	web_hexdump(ts_conn);
        }
        else ifcmp("hellomsg") tcp_puts_fd("Web on ESP8266!");
#ifdef USE_TCP2UART
        else ifcmp("tcp_") {
        	cstr+=4;
        	ifcmp("connected") {
        		if(tcp2uart_conn == NULL) tcp_put('0');
        		else tcp_put('1');
        	}
        	else ifcmp("remote") {
        		if(tcp2uart_conn != NULL) {
        			tcp_puts(IPSTR ":%d", IP2STR(&(tcp2uart_conn->remote_ip.dw)), tcp2uart_conn->remote_port);
        		}
        		else tcp_strcpy_fd("closed");
        	}
        	else ifcmp("host") {
        		if(tcp2uart_conn != NULL) tcp_puts(IPSTR ":%d", IP2STR(&(tcp2uart_conn->pcb->local_ip.addr)), tcp2uart_conn->pcb->local_port);
        		else tcp_strcpy_fd("none");
        	}
#if 0
       		else ifcmp("twrec") {
       			if(tcp2uart_conn!=NULL) tcp_puts("%u", tcp2uart_conn->pcfg->time_wait_rec);
       			else tcp_strcpy_fd("closed");
       		}
       		else ifcmp("twcls") {
       			if(tcp2uart_conn!=NULL) tcp_puts("%u", tcp2uart_conn->pcfg->time_wait_cls);
       			else tcp_strcpy_fd("closed");
       		}
#endif
       		else tcp_put('?');
        }
#endif // USE_TCP2UART
        else ifcmp("web_") {
        	cstr+=4;
#if 0
        	ifcmp("port") tcp_puts("%u", ts_conn->pcfg->port);
        	else
#endif
        		ifcmp("host") tcp_puts(IPSTR ":%d", IP2STR(&(ts_conn->pcb->local_ip.addr)), ts_conn->pcb->local_port);
        	else ifcmp("remote") tcp_puts(IPSTR ":%d", IP2STR(&(ts_conn->remote_ip.dw)), ts_conn->remote_port);
#if 0
        	else ifcmp("twrec") tcp_puts("%u", ts_conn->pcfg->time_wait_rec);
        	else ifcmp("twcls") tcp_puts("%u", ts_conn->pcfg->time_wait_cls);
#endif
        	else tcp_put('?');
        }
#ifdef USE_MODBUS
        else ifcmp("mdb_") {
        	cstr+=4;
       		ifcmp("host") tcp_puts(IPSTR ":%d", IP2STR(&(ts_conn->pcb->local_ip.addr)), ts_conn->pcb->local_port);
        	else ifcmp("remote") tcp_puts(IPSTR ":%d", IP2STR(&(ts_conn->remote_ip.dw)), ts_conn->remote_port);
        	else tcp_put('?');
        }
#endif
        else ifcmp("wfs_") {
        	cstr+=4;
        	ifcmp("files") tcp_puts("%u", numFiles);
        	else ifcmp("addr") tcp_puts("0x%08x", WEBFS_base_addr());
        	else ifcmp("size") tcp_puts("%u", WEBFS_curent_size());
        	else ifcmp("max_size") tcp_puts("%u", WEBFS_max_size());
        	else tcp_put('?');
        }
        else ifcmp("gpio") {
            cstr+=4;
        	if((*cstr>='0')&&(*cstr<='9')) {
        		uint32 n = atoi(cstr);
        		cstr++;
        		if(*cstr != '_') cstr++;
        		if(*cstr == '_' && n < 16) {
        			cstr++;
        			ifcmp("inp") {
        				if(GPIO_IN & (1<<n)) tcp_put('1');
        				else tcp_put('0');
        			}
        			else ifcmp("out") {
        				if(GPIO_OUT &(1<<n)) tcp_put('1');
        				else tcp_put('0');
        			}
        			else ifcmp("dir") {
        				if(GPIO_ENABLE & (1<<n)) tcp_put('1');
        				else tcp_put('0');
        			}
        			else ifcmp("fun") tcp_puts("%u", get_gpiox_mux_func(n));
        			else ifcmp("pull") tcp_puts("%u", (get_gpiox_mux(n) >> GPIO_MUX_PULLDOWN_BIT) & 3);
    	            else ifcmp("opd") tcp_put((GPIOx_PIN(n) & (1 << 2))? '1' : '0');
    	            else ifcmp("pu") tcp_put((get_gpiox_mux(n) & (1 << GPIO_MUX_PULLUP_BIT))? '1' : '0');
    	            else ifcmp("pd") tcp_put((get_gpiox_mux(n) & (1 << GPIO_MUX_PULLDOWN_BIT))? '1' : '0');
        			else tcp_put('?');
        		}
        		else tcp_put('?');
        	}
        	else if(*cstr == '_') {
        		cstr++;
        		ifcmp("inp") tcp_puts("%u", GPIO_IN & 0xFFFF);
        		else ifcmp("out") tcp_puts("%u", GPIO_OUT & 0xFFFF);
        		else ifcmp("dir") tcp_puts("%u", GPIO_ENABLE & 0xFFFF);
            	else tcp_put('?');
        	}
        	else tcp_put('?');
        }
#ifdef USE_SNTP
		else ifcmp("sntp_") {
			cstr += 5;
			ifcmp("time") tcp_puts("%u", get_sntp_time());
			else tcp_put('?');
		}
#endif
#ifdef USE_WDRV
		else ifcmp("wdrv_") {
			cstr+=5;
			ifcmp("freq") {
				tcp_puts("%u", wdrv_sample_rate);
			}
			else ifcmp("port") {
				tcp_puts("%u", wdrv_host_port);
			}
			else ifcmp("ip") {
				tcp_puts(IPSTR, IP2STR(&wdrv_host_ip));
			}
			else tcp_put('?');
		}
#endif
        else ifcmp("test_adc") web_test_adc(ts_conn);
		else tcp_put('?');
}

#endif // USE_WEB
